app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'Shucbert1'
 LIMIT 1
---
    public function loginPost()
    {
        $session = session();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();

INSERT INTO `users` (`username`, `password`, `nama`) VALUES ('Shucbert1', '$2y$10$4GGgUIlU9xo6NHK.k6GH8eVwnSClY1YekEwSLPFsTijWo8XmTkfAO', 'Shucbert')
---
    public function registerPost()
    {
        $userModel = new UserModel();

        $rules = [
            'username' => 'required|min_length[3]|max_length[20]|is_unique[users.username]',
            'password' => 'required|min_length[6]',
            'pass_confirm' => 'required_with[password]|matches[password]',
            'nama'     => 'required|max_length[50]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $data = [
            'username' => $this->request->getPost('username'),
            'password' => $this->request->getPost('password'),
            'nama'     => $this->request->getPost('nama'),
        ];

        if ($userModel->insert($data)) {