app/Controllers/Checkout.php

                'bukti_pembayaran' => null, // Default null, akan diisi saat konfirmasi jika diperlukan
            ];

            $transaksiId = $transaksiModel->insert($transaksiData, true);
---
INSERT INTO `transaksi` (`user_id`, `total_harga`, `tanggal`, `metode_pembayaran`, `status_pembayaran`, `bukti_pembayaran`) VALUES ('1', 65000, '2025-06-15 06:57:17', 'ShopeePay', 'pending', NULL)

                    'harga' => $item['subtotal'],
                ];

                $transaksiItemInserted = $transaksiItemModel->insert($itemInsertData);
---
INSERT INTO `transaksi_item` (`transaksi_id`, `produk_id`, `jumlah`, `harga`) VALUES (16, '35', '1', 65000)