app/Controllers/Transaksi.php

    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login untuk melihat riwayat transaksi.');
        }

        $transaksiModel = new TransaksiModel();
        $transaksiItemModel = new TransaksiItemModel();
        $produkModel = new ProdukModel();

        $daftarTransaksi = $transaksiModel->getTransaksiByUser(session()->get('userId'));

        foreach ($daftarTransaksi as &$trans) {
            $transaksiItems = $transaksiItemModel->where('transaksi_id', $trans['id'])->findAll();
---
SELECT *
FROM `transaksi_item`
WHERE `transaksi_id` = '18'

    public function confirmPayment($transaksiId = null)
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login untuk konfirmasi pembayaran.');
        }

        if ($transaksiId === null) {
            return redirect()->to('/transaksi')->with('error', 'ID Transaksi tidak valid.');
        }

        $transaksiModel = new TransaksiModel();
        $transaksi = $transaksiModel->find($transaksiId);

        // Pastikan transaksi ditemukan dan milik user yang sedang login
        if (empty($transaksi) || $transaksi['user_id'] != $session->get('userId')) {
            return redirect()->to('/transaksi')->with('error', 'Transaksi tidak ditemukan atau Anda tidak memiliki akses.');
        }

        // Hanya bisa konfirmasi jika status masih 'pending'
        if ($transaksi['status_pembayaran'] == 'pending') {
            $updateData = [
                'status_pembayaran' => 'paid', // Mengubah status menjadi 'paid' atau 'berhasil'
                // 'bukti_pembayaran' => 'Pembayaran_oleh_' . $session->get('username') . '_pada_' . date('Ymd_His'), // Isi jika kolom ada
            ];

            if ($transaksiModel->update($transaksiId, $updateData)) {
---
SELECT *
FROM `transaksi`
WHERE `transaksi`.`id` = '19'
UPDATE `transaksi` SET `status_pembayaran` = 'paid'
WHERE `transaksi`.`id` IN ('19')