app/Models/CartModel.php

    public function getItems($userId)
    {
        return $this->select('keranjang.*, produk.nama, produk.harga, produk.gambar, produk.deskripsi')
            // UBAH DARI 'keranjang.produk_id' MENJADI 'keranjang.product_id'
            ->join('products as produk', 'produk.id = keranjang.product_id') // <--- PERUBAHAN DI BARIS INI
            ->where('keranjang.user_id', $userId)
            ->findAll();
---
SELECT `keranjang`.*, `produk`.`nama`, `produk`.`harga`, `produk`.`gambar`, `produk`.`deskripsi`
FROM `keranjang`
JOIN `products` as `produk` ON `produk`.`id` = `keranjang`.`product_id`
WHERE `keranjang`.`user_id` = '1'