app/Models/TransaksiModel.php

    public function getTransaksiByUser($userId)
    {
        return $this->select('transaksi.*, users.username')
                    ->join('users', 'users.id = transaksi.user_id')
                    ->where('transaksi.user_id', $userId)
                    ->orderBy('transaksi.tanggal', 'DESC')
                    ->findAll();
---
SELECT `transaksi`.*, `users`.`username`
FROM `transaksi`
JOIN `users` ON `users`.`id` = `transaksi`.`user_id`
WHERE `transaksi`.`user_id` = '4'
ORDER BY `transaksi`.`tanggal` DESC